---
permalink: system-admin/online-help-at-sp-bmc-cli-task.html
sidebar: sidebar
keywords: online, help, sp, bmc, cli, command
summary: "The online help displays the SP/BMC CLI commands and options."
---
= Use online help at the SP/BMC CLI
:icons: font
:imagesdir: ../media/

[.lead]
The online help displays the SP/BMC CLI commands and options.

.About this task

This task applies to both the SP and the BMC.

.Steps

. To display help information for the SP/BMC commands, enter the following:
+
[options="header"]
|===
| To access SP help...| To access BMC help...
a|
Type `help` at the SP prompt.
a|
Type `system` at the BMC prompt.
|===
+
The following example shows the SP CLI online help.
+
----
SP> help
date - print date and time
exit - exit from the SP command line interface
events - print system events and event information
help - print command help
priv - show and set user mode
sp - commands to control the SP
system - commands to control the system
version - print SP version
----
+
The following example shows the BMC CLI online help.
+
----
BMC> system
Usage: system cmd [option]

Support cmd list
        help - display this help message
        fw - platform firmware related feature
        log - log related feature
        reset - reset the system
        console - connect to the system console
        core - dump the system core and reset
        power - system power related feature
        fru - FRU related feature

Support option list
        help: display the help message of the cmd
----

. To display help information for the option of an SP/BMC command, enter `help` before or after the SP/BMC command.
+
The following example shows the SP CLI online help for the SP `events` command.
+
----
SP> help events
events all - print all system events
events info - print system event log information
events newest - print newest system events
events oldest - print oldest system events
events search - search for and print system events
----
+
The following example shows the BMC CLI online help for the BMC `system power` command.
+
----
BMC> system power help
Usage: system power [option]

Support option list
        help: print this help message
        cycle: power cycle the system, then on
        off: power the system off
        on: power the system on
        status: system power status
----
